tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
cask "java"
cask "osxfuse"
# Automatic configure script builder
brew "autoconf"
# GNU database manager
brew "gdbm"
# SSL/TLS cryptography library
brew "openssl"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# C string library for manipulating Unicode strings
brew "libunistring"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Mac App Store command-line interface
brew "mas"
# Text-based UI library
brew "ncurses"
# Platform built on V8 to build network applications
brew "node"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Manage compile and link flags for libraries
brew "pkg-config"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# Compression and file packaging/archive utility
brew "zip"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "android-studio"
cask "archi"
cask "balenaetcher"
cask "calibre"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-drive-file-stream"
cask "hyper"
cask "intellij-idea-ce"
cask "logitech-options"
cask "pikopixel"
cask "playonmac"
cask "pocket-casts"
cask "postman"
cask "recordit"
cask "rocket"
cask "skype"
cask "slack"
cask "steam"
cask "twitch"
cask "visual-studio-code"
cask "vlc"
cask "zeplin"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-fira-mono"
cask "caskroom/fonts/font-fira-mono-for-powerline"
cask "caskroom/fonts/font-fira-sans"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/fonts/font-input"
cask "caskroom/fonts/font-mononoki-nerd-font-mono"
cask "caskroom/fonts/font-open-sans"
cask "caskroom/fonts/font-open-sans-condensed"
cask "caskroom/fonts/font-powerline-symbols"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-sourcecodepro-nerd-font"
cask "caskroom/fonts/font-ubuntu"
cask "caskroom/fonts/font-ubuntu-mono-derivative-powerline"
cask "caskroom/fonts/font-ubuntu-nerd-font"
cask "caskroom/fonts/font-ubuntumono-nerd-font"
mas "com.apple.dt.Xcode", id: 497799835
mas "com.apple.garageband10", id: 682658836
mas "com.apple.iMovieApp", id: 408981434
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.crowdcafe.windowmagnet", id: 441258766
mas "com.microsoft.Excel", id: 462058435
mas "com.microsoft.OneDrive-mac", id: 823766827
mas "com.microsoft.Powerpoint", id: 462062816
mas "com.microsoft.rdc.macos", id: 1295203466
mas "com.microsoft.Word", id: 462054704
mas "com.readdle.smartemail-Mac", id: 1176895641
mas "cx.c3.theunarchiver", id: 425424353
mas "desktop.WhatsApp", id: 1147396723
mas "net.shinyfrog.bear", id: 1091189122
mas "org.getgreenshot.Greenshot", id: 1103915944
