tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "linux-noah/noah"
cask "osxfuse"
# Program for encryption/decryption
brew "aescrypt"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
brew "kubernetes-helm"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql-client"
# Platform built on V8 to build network applications
brew "node"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# SSL/TLS cryptography library
brew "openssl"
# YubiKey personalization library and tool
brew "ykpers"
# Yubico pluggable authentication module
brew "pam_yubico"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Ruby version manager
brew "rbenv"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# Compression and file packaging/archive utility
brew "zip"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Darwin subsystem for Linux (Bash on macOS)
brew "linux-noah/noah/noah"
cask "1password"
cask "adobe-acrobat-reader"
cask "archi"
cask "calibre"
cask "datovka"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-input"
cask "font-mononoki-nerd-font-mono"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "font-sourcecodepro-nerd-font"
cask "font-ubuntu"
cask "font-ubuntu-mono-derivative-powerline"
cask "font-ubuntu-nerd-font"
cask "font-ubuntumono-nerd-font"
cask "fork"
cask "gifox"
cask "google-chrome"
cask "google-drive-file-stream"
cask "iterm2"
cask "java"
cask "kube-forwarder"
cask "logitech-options"
cask "mactex"
cask "minecraft"
cask "notion"
cask "obs"
cask "pikopixel"
cask "plex"
cask "postman"
cask "razer-synapse"
cask "rocket"
cask "skype"
cask "skype-for-business"
cask "slack"
cask "spotify"
cask "steam"
cask "toggl"
cask "twitch"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
cask "yubico-yubikey-manager"
mas "Agenda", id: 1287445660
mas "Apple Configurator 2", id: 1037126344
mas "GarageBand", id: 682658836
mas "Greenshot", id: 1103915944
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
