tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
cask "osxfuse"
# Automatic configure script builder
brew "autoconf"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# SSL/TLS cryptography library
brew "openssl"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Docker Machine driver for xhyve
brew "docker-machine-driver-xhyve"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Load testing and performance measurement application
brew "jmeter"
# The Kubernetes package manager
brew "kubernetes-helm"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Node version management
brew "n"
# Text-based UI library
brew "ncurses"
# Platform built on V8 to build network applications
brew "node"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Lightweight macOS virtualization solution based on FreeBSD's bhyve
brew "xhyve"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# Compression and file packaging/archive utility
brew "zip"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "1password"
cask "android-studio"
cask "archi"
cask "calibre"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-drive-file-stream"
cask "hyper"
cask "java"
cask "gifox"
cask "jsui"
cask "logitech-options"
cask "mactex-no-gui"
cask "minecraft"
cask "nightowl"
cask "pikopixel"
cask "kube-forwarder"
cask "playonmac"
cask "postman"
cask "rocket"
cask "skype"
cask "skype-for-business"
cask "razer-synapse"
cask "slack"
cask "steam"
cask "toggl"
cask "twitch"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "xquartz"
cask "zeplin"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-fira-mono"
cask "caskroom/fonts/font-fira-mono-for-powerline"
cask "caskroom/fonts/font-fira-sans"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/fonts/font-input"
cask "caskroom/fonts/font-mononoki-nerd-font-mono"
cask "caskroom/fonts/font-open-sans"
cask "caskroom/fonts/font-open-sans-condensed"
cask "caskroom/fonts/font-powerline-symbols"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-sourcecodepro-nerd-font"
cask "caskroom/fonts/font-ubuntu"
cask "caskroom/fonts/font-ubuntu-mono-derivative-powerline"
cask "caskroom/fonts/font-ubuntu-nerd-font"
cask "caskroom/fonts/font-ubuntumono-nerd-font"
mas "Agenda", id: 1287445660
mas "GarageBand", id: 682658836
mas "Greenshot", id: 1103915944
mas "Hotspot Shield", id: 771076721
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Xcode", id: 497799835
